performance/p1/blog-p1-stability.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Blog P1 Stability" enabled="true">
      <stringProp name="TestPlan.comments">PERF-09 30 minute mixed read stability</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">${__P(host,127.0.0.1)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,8080)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp><stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp>
      </ConfigTestElement><hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Common Headers" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="Accept" elementType="Header"><stringProp name="Header.name">Accept</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="PERF-09 Stability" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">true</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp><stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(rampSeconds,30)}</stringProp><boolProp name="ThreadGroup.scheduler">true</boolProp><stringProp name="ThreadGroup.duration">${__P(durationSeconds,1800)}</stringProp><stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Target Throughput" enabled="true"><stringProp name="throughput">${__P(throughputPerMinute,600)}</stringProp><intProp name="calcMode">1</intProp></ConstantThroughputTimer><hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Choose Read Path" enabled="true"><stringProp name="cacheKey">true</stringProp><stringProp name="filename"></stringProp><stringProp name="parameters"></stringProp><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">def roll = java.util.concurrent.ThreadLocalRandom.current().nextInt(100)&#10;def id = props.getProperty('articleId', '1')&#10;def keyword = props.getProperty('keyword', '%E6%80%A7%E8%83%BD')&#10;def path = roll &lt; 35 ? '/api/v1/articles?pageNum=1&amp;pageSize=10' : roll &lt; 65 ? '/api/v1/articles/' + id : roll &lt; 80 ? '/api/v1/articles?keyword=' + keyword + '&amp;pageNum=1&amp;pageSize=10' : roll &lt; 90 ? '/api/v1/articles/' + id + '/comments?pageNum=1&amp;pageSize=10' : '/api/v1/messages?pageNum=1&amp;pageSize=10'&#10;vars.put('stabilityPath', path)</stringProp></JSR223PreProcessor><hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Mixed stability request" enabled="true"><stringProp name="HTTPSampler.path">${stabilityPath}</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.follow_redirects">true</boolProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp></HTTPSamplerProxy><hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 200" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><boolProp name="Assertion.assume_success">false</boolProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>